STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/**
  **********************************************************************************************************************
  * @file   stm32u5xx_ll_gtzc.h
  * @brief  Header file of GTZC LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */
/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_LL_GTZC_H
#define STM32U5XX_LL_GTZC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

/** @addtogroup GTZC_LL GTZC
  * @{
  */
/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/* Private macros ----------------------------------------------------------------------------------------------------*/
/* Exported macros ---------------------------------------------------------------------------------------------------*/
/* Exported types ----------------------------------------------------------------------------------------------------*/
/* Exported variables ------------------------------------------------------------------------------------------------*/
/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup GTZC_LL_Exported_Constants GTZC LL Exported Constants
  * @{
  */

/** @defgroup GTZC_LL_EC_RegisterSelection Register Selection
  * @{
  */
#define LL_GTZC1_PERIPH_REG1 00U                        /*!< GTZC1 peripherals register 1 */
#define LL_GTZC1_PERIPH_REG2 32U                        /*!< GTZC1 peripherals register 2 */
#define LL_GTZC1_PERIPH_REG3 64U                        /*!< GTZC1 peripherals register 3 */
#define LL_GTZC1_PERIPH_REG4 96U                        /*!< GTZC1 peripherals register 4 */
#define LL_GTZC2_PERIPH_REG1 (00U + AHB3PERIPH_BASE_NS) /*!< GTZC2 peripherals register 1 */
#define LL_GTZC2_PERIPH_REG2 (32U + AHB3PERIPH_BASE_NS) /*!< GTZC2 peripherals register 2 */
/**
  * @}
  */

/** @defgroup GTZC_LL_EC_WatermarkMaximumDescriptos Watermark Maximum Descriptos
  * @{
  */
#define LL_GTZC_MPCWM_MAX_DESC 5U /*!< GTZC Watermark maximum descriptors */
/**
  * @}
  */

/** @defgroup GTZC_LL_EC_PeripheralSelection Peripheral Selection
  * @{
  */

/**
  * @brief GTZC1 (ILAC/SEC/PRIV)CFGR1 peripheral selection
  */
#define LL_GTZC1_GRP1_TIM2   GTZC_CFGR1_TIM2_Msk   /*!< LL GTZC1 CFGR1 peripheral TIM2   */
#define LL_GTZC1_GRP1_TIM3   GTZC_CFGR1_TIM3_Msk   /*!< LL GTZC1 CFGR1 peripheral TIM3   */
#define LL_GTZC1_GRP1_TIM4   GTZC_CFGR1_TIM4_Msk   /*!< LL GTZC1 CFGR1 peripheral TIM4   */
#define LL_GTZC1_GRP1_TIM5   GTZC_CFGR1_TIM5_Msk   /*!< LL GTZC1 CFGR1 peripheral TIM5   */
#define LL_GTZC1_GRP1_TIM6   GTZC_CFGR1_TIM6_Msk   /*!< LL GTZC1 CFGR1 peripheral TIM6   */
#define LL_GTZC1_GRP1_TIM7   GTZC_CFGR1_TIM7_Msk   /*!< LL GTZC1 CFGR1 peripheral TIM7   */
#define LL_GTZC1_GRP1_WWDG   GTZC_CFGR1_WWDG_Msk   /*!< LL GTZC1 CFGR1 peripheral WWDG   */
#define LL_GTZC1_GRP1_IWDG   GTZC_CFGR1_IWDG_Msk   /*!< LL GTZC1 CFGR1 peripheral IWDG   */
#define LL_GTZC1_GRP1_SPI2   GTZC_CFGR1_SPI2_Msk   /*!< LL GTZC1 CFGR1 peripheral SPI2   */
#if defined(USART2)
#define LL_GTZC1_GRP1_USART2 GTZC_CFGR1_USART2_Msk /*!< LL GTZC1 CFGR1 peripheral USART2 */
#endif /* USART2 */
#define LL_GTZC1_GRP1_USART3 GTZC_CFGR1_USART3_Msk /*!< LL GTZC1 CFGR1 peripheral USART3 */
#define LL_GTZC1_GRP1_UART4  GTZC_CFGR1_UART4_Msk  /*!< LL GTZC1 CFGR1 peripheral UART4  */
#define LL_GTZC1_GRP1_UART5  GTZC_CFGR1_UART5_Msk  /*!< LL GTZC1 CFGR1 peripheral UART5  */
#define LL_GTZC1_GRP1_I2C1   GTZC_CFGR1_I2C1_Msk   /*!< LL GTZC1 CFGR1 peripheral I2C1   */
#define LL_GTZC1_GRP1_I2C2   GTZC_CFGR1_I2C2_Msk   /*!< LL GTZC1 CFGR1 peripheral I2C2   */
#define LL_GTZC1_GRP1_CRS    GTZC_CFGR1_CRS_Msk    /*!< LL GTZC1 CFGR1 peripheral CRS    */
#define LL_GTZC1_GRP1_I2C4   GTZC_CFGR1_I2C4_Msk   /*!< LL GTZC1 CFGR1 peripheral I2C4   */
#define LL_GTZC1_GRP1_LPTIM2 GTZC_CFGR1_LPTIM2_Msk /*!< LL GTZC1 CFGR1 peripheral LPTIM2 */
#define LL_GTZC1_GRP1_FDCAN1 GTZC_CFGR1_FDCAN1_Msk /*!< LL GTZC1 CFGR1 peripheral FDCAN1 */
#if defined(UCPD1)
#define LL_GTZC1_GRP1_UCPD1  GTZC_CFGR1_UCPD1_Msk  /*!< LL GTZC1 CFGR1 peripheral UCPD1  */
#endif /* UCPD1 */
#if defined(USART6)
#define LL_GTZC1_GRP1_USART6 GTZC_CFGR1_USART6_Msk /*!< LL GTZC1 CFGR1 peripheral USART6 */
#endif /* USART6 */
#if defined (I2C5)
#define LL_GTZC1_GRP1_I2C5   GTZC_CFGR1_I2C5_Msk   /*!< LL GTZC1 CFGR1 peripheral I2C5   */
#endif /* I2C5 */
#if defined (I2C6)
#define LL_GTZC1_GRP1_I2C6   GTZC_CFGR1_I2C6_Msk   /*!< LL GTZC1 CFGR1 peripheral I2C6   */
#endif /* I2C6 */
#if defined (USART6)
#define LL_GTZC1_GRP1_ALL    0x00EFFFFFU           /*!< LL GTZC1 CFGR1 ALL peripherals   */
#elif defined (USART2)
#define LL_GTZC1_GRP1_ALL    0x000FFFFFU           /*!< LL GTZC1 CFGR1 ALL peripherals   */
#else
#define LL_GTZC1_GRP1_ALL    0x0007FDFFU           /*!< LL GTZC1 CFGR1 ALL peripherals   */
#endif /* USART6 */

/**
  * @brief GTZC1 (ILAC/SEC/PRIV)CFGR2 peripheral selection
  */
#define LL_GTZC1_GRP2_TIM1     GTZC_CFGR2_TIM1_Msk    /*!< LL GTZC1 CFGR2 peripheral TIM1        */
#define LL_GTZC1_GRP2_SPI1     GTZC_CFGR2_SPI1_Msk    /*!< LL GTZC1 CFGR2 peripheral SPI1        */
#define LL_GTZC1_GRP2_TIM8     GTZC_CFGR2_TIM8_Msk    /*!< LL GTZC1 CFGR2 peripheral TIM8        */
#define LL_GTZC1_GRP2_USART1   GTZC_CFGR2_USART1_Msk  /*!< LL GTZC1 CFGR2 peripheral USART1      */
#define LL_GTZC1_GRP2_TIM15    GTZC_CFGR2_TIM15_Msk   /*!< LL GTZC1 CFGR2 peripheral TIM15       */
#define LL_GTZC1_GRP2_TIM16    GTZC_CFGR2_TIM16_Msk   /*!< LL GTZC1 CFGR2 peripheral TIM16       */
#define LL_GTZC1_GRP2_TIM17    GTZC_CFGR2_TIM17_Msk   /*!< LL GTZC1 CFGR2 peripheral TIM17       */
#define LL_GTZC1_GRP2_SAI1     GTZC_CFGR2_SAI1_Msk    /*!< LL GTZC1 CFGR2 peripheral SAI1        */
#if defined(SAI2)
#define LL_GTZC1_GRP2_SAI2     GTZC_CFGR2_SAI2_Msk    /*!< LL GTZC1 CFGR2 peripheral SAI2        */
#endif /* SAI2 */
#if defined(GTZC_CFGR2_LTDCUSB_Msk)
#define LL_GTZC1_GRP2_LTDC_USB GTZC_CFGR2_LTDCUSB_Msk /*!< LL GTZC1 CFGR2 peripheral LTDC or USB */
#endif /* GTZC_CFGR2_LTDCUSB_Msk*/
#if defined (DSI)
#define LL_GTZC1_GRP2_DSI      GTZC_CFGR2_DSI_Msk     /*!< LL GTZC1 CFGR2 peripheral DSI         */
#endif /* DSI */
#if defined (GFXTIM)
#define LL_GTZC1_GRP2_GFXTIM   GTZC_CFGR2_GFXTIM_Msk  /*!< LL GTZC1 CFGR2 peripheral GFXTIM      */
#endif /* GFXTIM */

#if defined (GFXTIM)
#define LL_GTZC1_GRP2_ALL      0x00000FFFU            /*!< LL GTZC1 CFGR2 ALL peripherals        */
#elif defined (LTDC)
#define LL_GTZC1_GRP2_ALL      0x000007FFU            /*!< LL GTZC1 CFGR2 ALL peripherals        */
#elif defined (SAI2)
#define LL_GTZC1_GRP2_ALL      0x000001FFU            /*!< LL GTZC1 CFGR2 ALL peripherals        */
#else
#define LL_GTZC1_GRP2_ALL      0x000002FFU            /*!< LL GTZC1 CFGR2 ALL peripherals        */
#endif /* GFXTIM */

/**
  * @brief GTZC1 (ILAC/SEC/PRIV)CFGR3 peripheral selection
  */
#define LL_GTZC1_GRP3_MDF1         GTZC_CFGR3_MDF1_Msk         /*!< LL GTZC1 CFGR3 peripheral MDF1         */
#define LL_GTZC1_GRP3_CORDIC       GTZC_CFGR3_CORDIC_Msk       /*!< LL GTZC1 CFGR3 peripheral CORDIC       */
#define LL_GTZC1_GRP3_FMAC         GTZC_CFGR3_FMAC_Msk         /*!< LL GTZC1 CFGR3 peripheral FMAC         */
#define LL_GTZC1_GRP3_CRC          GTZC_CFGR3_CRC_Msk          /*!< LL GTZC1 CFGR3 peripheral CRC          */
#define LL_GTZC1_GRP3_TSC          GTZC_CFGR3_TSC_Msk          /*!< LL GTZC1 CFGR3 peripheral TSC          */
#if defined(DMA2D)
#define LL_GTZC1_GRP3_DMA2D        GTZC_CFGR3_DMA2D_Msk        /*!< LL GTZC1 CFGR3 peripheral DMAD2        */
#endif /* DMA2D */
#define LL_GTZC1_GRP3_ICACHE_REG   GTZC_CFGR3_ICACHE_REG_Msk   /*!< LL GTZC1 CFGR3 peripheral ICACHE_REG   */
#define LL_GTZC1_GRP3_DCACHE1_REG  GTZC_CFGR3_DCACHE1_REG_Msk  /*!< LL GTZC1 CFGR3 peripheral DCACHE_REG   */
#define LL_GTZC1_GRP3_ADC12        GTZC_CFGR3_ADC12_Msk        /*!< LL GTZC1 CFGR3 peripheral ADC12        */
#define LL_GTZC1_GRP3_DCMI         GTZC_CFGR3_DCMI_Msk         /*!< LL GTZC1 CFGR3 peripheral DCMI_PSSI    */
#if defined (USB_OTG_GLOBAL_BASE)
#define LL_GTZC1_GRP3_OTG          GTZC_CFGR3_OTG_Msk          /*!< LL GTZC1 CFGR3 peripheral OTG          */
#endif /* USB_OTG_GLOBAL_BASE */
#if defined(AES)
#define LL_GTZC1_GRP3_AES          GTZC_CFGR3_AES_Msk          /*!< LL GTZC1 CFGR3 peripheral AES          */
#endif /* AES */
#define LL_GTZC1_GRP3_HASH         GTZC_CFGR3_HASH_Msk         /*!< LL GTZC1 CFGR3 peripheral HASH         */
#define LL_GTZC1_GRP3_RNG          GTZC_CFGR3_RNG_Msk          /*!< LL GTZC1 CFGR3 peripheral RNG          */
#if defined(PKA)
#define LL_GTZC1_GRP3_PKA          GTZC_CFGR3_PKA_Msk          /*!< LL GTZC1 CFGR3 peripheral PKA          */
#endif /* PKA */
#if defined(SAES)
#define LL_GTZC1_GRP3_SAES         GTZC_CFGR3_SAES_Msk         /*!< LL GTZC1 CFGR3 peripheral SAES         */
#endif /* SAES */
#if defined(OCTOSPIM)
#define LL_GTZC1_GRP3_OCTOSPIM     GTZC_CFGR3_OCTOSPIM_Msk     /*!< LL GTZC1 CFGR3 peripheral OCTOSPIM     */
#endif /* OCTOSPIM */
#define LL_GTZC1_GRP3_SDMMC1       GTZC_CFGR3_SDMMC1_Msk       /*!< LL GTZC1 CFGR3 peripheral SDMMC1       */
#if defined(SDMMC2)
#define LL_GTZC1_GRP3_SDMMC2       GTZC_CFGR3_SDMMC2_Msk       /*!< LL GTZC1 CFGR3 peripheral SDMMC2       */
#endif /* SDMMC2 */
#if defined(FMC_BASE)
#define LL_GTZC1_GRP3_FSMC_REG     GTZC_CFGR3_FSMC_REG_Msk     /*!< LL GTZC1 CFGR3 peripheral FSMC_REG     */
#endif /* FMC_BASE */
#define LL_GTZC1_GRP3_OCTOSPI1_REG GTZC_CFGR3_OCTOSPI1_REG_Msk /*!< LL GTZC1 CFGR3 peripheral OCTOSPI1_REG */
#if defined(OCTOSPI2)
#define LL_GTZC1_GRP3_OCTOSPI2_REG GTZC_CFGR3_OCTOSPI2_REG_Msk /*!< LL GTZC1 CFGR3 peripheral OCTOSPI2_REG */
#endif /* OCTOSPI2 */
#define LL_GTZC1_GRP3_RAMCFG       GTZC_CFGR3_RAMCFG_Msk       /*!< LL GTZC1 CFGR3 peripheral RAMCFG       */
#if defined (GPU2D)
#define LL_GTZC1_GRP3_GPU2D        GTZC_CFGR3_GPU2D_Msk        /*!< LL GTZC1 CFGR3 peripheral GPU2D        */
#endif /* GPU2D */
#if defined (GFXMMU)
#define LL_GTZC1_GRP3_GFXMMU       GTZC_CFGR3_GFXMMU_Msk       /*!< LL GTZC1 CFGR3 peripheral GFXMMU       */
#define LL_GTZC1_GRP3_GFXMMU_REG   GTZC_CFGR3_GFXMMU_REG_Msk   /*!< LL GTZC1 CFGR3 peripheral GFXMMU_REG   */
#endif /* GFXMMU */
#if defined (HSPI1)
#define LL_GTZC1_GRP3_HSPI1_REG    GTZC_CFGR3_HSPI1_REG_Msk    /*!< LL GTZC1 CFGR3 peripheral HSPI1_REG    */
#endif /* HSPI1 */
#if defined (DCACHE2)
#define LL_GTZC1_GRP3_DCACHE2_REG  GTZC_CFGR3_DCACHE2_REG_Msk  /*!< LL GTZC1 CFGR3 peripheral DCACHE2_REG  */
#endif /* DCACHE2 */
#if defined (JPEG)
#define LL_GTZC1_GRP3_JPEG         GTZC_CFGR3_JPEG_Msk         /*!< LL GTZC1 CFGR3 peripheral JPEG         */
#endif /* JPEG */

#if defined (JPEG)
#define LL_GTZC1_GRP3_ALL          0x1FFFFFFFU                 /*!< LL GTZC1 CFGR3 ALL peripherals         */
#elif defined (DCACHE2)
#define LL_GTZC1_GRP3_ALL          0x0FFFFFFFU                 /*!< LL GTZC1 CFGR3 ALL peripherals         */
#elif defined (OCTOSPI2)
#define LL_GTZC1_GRP3_ALL          0x007FFFFFU                 /*!< LL GTZC1 CFGR3 ALL peripherals         */
#else
#define LL_GTZC1_GRP3_ALL          0x0052FBDFU                 /*!< LL GTZC1 CFGR3 ALL peripherals         */
#endif /* JPEG */

/**
  * @brief GTZC1 (ILAC)CFGR4 peripheral selection
  */
#define LL_GTZC1_GRP4_GPDMA1       GTZC_CFGR4_GPDMA1_Msk       /*!< LL GTZC1 CFGR4 peripheral GPDMA1       */
#define LL_GTZC1_GRP4_FLASH_REG    GTZC_CFGR4_FLASH_REG_Msk    /*!< LL GTZC1 CFGR4 peripheral FLASH_REG    */
#define LL_GTZC1_GRP4_FLASH        GTZC_CFGR4_FLASH_Msk        /*!< LL GTZC1 CFGR4 peripheral FLASH        */
#if defined(OTFDEC1)
#define LL_GTZC1_GRP4_OTFDEC1      GTZC_CFGR4_OTFDEC1_Msk      /*!< LL GTZC1 CFGR4 peripheral OTFDEC2      */
#endif /* OTFDEC1 */
#if defined(OTFDEC2)
#define LL_GTZC1_GRP4_OTFDEC2      GTZC_CFGR4_OTFDEC2_Msk      /*!< LL GTZC1 CFGR4 peripheral OTFDEC1      */
#endif /* OTFDEC2 */
#define LL_GTZC1_GRP4_TZSC1        GTZC_CFGR4_TZSC1_Msk        /*!< LL GTZC1 CFGR4 peripheral TZSC1        */
#define LL_GTZC1_GRP4_TZIC1        GTZC_CFGR4_TZIC1_Msk        /*!< LL GTZC1 CFGR4 peripheral TZIC1        */
#define LL_GTZC1_GRP4_OCTOSPI1_MEM GTZC_CFGR4_OCTOSPI1_MEM_Msk /*!< LL GTZC1 CFGR4 peripheral OCTOSPI_MEM  */
#if defined(FMC_BASE)
#define LL_GTZC1_GRP4_FSMC_MEM     GTZC_CFGR4_FSMC_MEM_Msk     /*!< LL GTZC1 CFGR4 peripheral FSMC_MEM     */
#endif /* FMC_BASE */
#define LL_GTZC1_GRP4_BKPSRAM      GTZC_CFGR4_BKPSRAM_Msk      /*!< LL GTZC1 CFGR4 peripheral BKPSRAM      */
#if defined(OCTOSPI2)
#define LL_GTZC1_GRP4_OCTOSPI2_MEM GTZC_CFGR4_OCTOSPI2_MEM_Msk /*!< LL GTZC1 CFGR4 peripheral OCTOSPI2_MEM */
#endif /* OCTOSPI2 */
#if defined(HSPI1)
#define LL_GTZC1_GRP4_HSPI1_MEM    GTZC_CFGR4_HSPI1_MEM_Msk    /*!< LL GTZC1 CFGR4 peripheral HSPI1_MEM    */
#endif /* HSPI1 */
#define LL_GTZC1_GRP4_SRAM1        GTZC_CFGR4_SRAM1_Msk        /*!< LL GTZC1 CFGR4 peripheral SRAM1        */
#define LL_GTZC1_GRP4_MPCBB1_REG   GTZC_CFGR4_MPCBB1_REG_Msk   /*!< LL GTZC1 CFGR4 peripheral MPCBB1_REG   */
#define LL_GTZC1_GRP4_SRAM2        GTZC_CFGR4_SRAM2_Msk        /*!< LL GTZC1 CFGR4 peripheral SRAM2        */
#define LL_GTZC1_GRP4_MPCBB2_REG   GTZC_CFGR4_MPCBB2_REG_Msk   /*!< LL GTZC1 CFGR4 peripheral MPCBB2_REG   */
#if defined(SRAM3_BASE)
#define LL_GTZC1_GRP4_SRAM3        GTZC_CFGR4_SRAM3_Msk        /*!< LL GTZC1 CFGR4 peripheral SRAM3        */
#define LL_GTZC1_GRP4_MPCBB3_REG   GTZC_CFGR4_MPCBB3_REG_Msk   /*!< LL GTZC1 CFGR4 peripheral MPCBB3_REG   */
#endif /* SRAM3_BASE */
#if defined(SRAM5_BASE)
#define LL_GTZC1_GRP4_SRAM5        GTZC_CFGR4_SRAM5_Msk        /*!< LL GTZC1 CFGR4 peripheral SRAM5        */
#define LL_GTZC1_GRP4_MPCBB5_REG   GTZC_CFGR4_MPCBB5_REG_Msk   /*!< LL GTZC1 CFGR4 peripheral MPCBB5_REG   */
#endif /* SRAM5_BASE */

