STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
#if defined(SRAM5_BASE)
#define LL_GTZC1_GRP4_ALL          0xFF1FC01FU                 /*!< LL GTZC1 CFGR4 ALL peripherals         */
#elif defined(OCTOSPI2)
#define LL_GTZC1_GRP4_ALL          0x3F0FC01FU                 /*!< LL GTZC1 CFGR4 ALL peripherals         */
#else
#define LL_GTZC1_GRP4_ALL          0x0F05C00FU                 /*!< LL GTZC1 CFGR4 ALL peripherals         */
#endif /* SRAM5_BASE */

/**
  * @brief GTZC2 (ILAC/SEC/PRIV)CFGR2 peripheral selection
  */
#define LL_GTZC2_GRP1_SPI3    GTZC_CFGR1_SPI3_Msk    /*!< LL GTZC2 CFGR1 peripheral SPI3     */
#define LL_GTZC2_GRP1_LPUART1 GTZC_CFGR1_LPUART1_Msk /*!< LL GTZC2 CFGR1 peripheral LPUART1  */
#define LL_GTZC2_GRP1_I2C3    GTZC_CFGR1_I2C3_Msk    /*!< LL GTZC2 CFGR1 peripheral I2C3     */
#define LL_GTZC2_GRP1_LPTIM1  GTZC_CFGR1_LPTIM1_Msk  /*!< LL GTZC2 CFGR1 peripheral LPTIM1   */
#define LL_GTZC2_GRP1_LPTIM3  GTZC_CFGR1_LPTIM3_Msk  /*!< LL GTZC2 CFGR1 peripheral LPTIM3   */
#define LL_GTZC2_GRP1_LPTIM4  GTZC_CFGR1_LPTIM4_Msk  /*!< LL GTZC2 CFGR1 peripheral LPTIM4   */
#define LL_GTZC2_GRP1_OPAMP   GTZC_CFGR1_OPAMP_Msk   /*!< LL GTZC2 CFGR1 peripheral OPAMP    */
#define LL_GTZC2_GRP1_COMP    GTZC_CFGR1_COMP_Msk    /*!< LL GTZC2 CFGR1 peripheral COMP     */
#define LL_GTZC2_GRP1_ADC4    GTZC_CFGR1_ADC4_Msk    /*!< LL GTZC2 CFGR1 peripheral ADC4     */
#define LL_GTZC2_GRP1_VREFBUF GTZC_CFGR1_VREFBUF_Msk /*!< LL GTZC2 CFGR1 peripheral  VREFBUF */
#define LL_GTZC2_GRP1_DAC1    GTZC_CFGR1_DAC1_Msk    /*!< LL GTZC2 CFGR1 peripheral DAC1     */
#define LL_GTZC2_GRP1_ADF1    GTZC_CFGR1_ADF1_Msk    /*!< LL GTZC2 CFGR1 peripheral ADF1     */
#define LL_GTZC2_GRP1_ALL     0x00001BFFU            /*!< LL GTZC2 CFGR2 ALL peripherals     */

/**
  * @brief GTZC2 (ILAC)CFGR2 peripheral selection
  */
#define LL_GTZC2_GRP2_SYSCFG     GTZC_CFGR2_SYSCFG_Msk     /*!< LL GTZC2 CFGR2 peripheral SYSCFG     */
#define LL_GTZC2_GRP2_RTC        GTZC_CFGR2_RTC_Msk        /*!< LL GTZC2 CFGR2 peripheral RTC        */
#define LL_GTZC2_GRP2_TAMP       GTZC_CFGR2_TAMP_Msk       /*!< LL GTZC2 CFGR2 peripheral TAMP       */
#define LL_GTZC2_GRP2_PWR        GTZC_CFGR2_PWR_Msk        /*!< LL GTZC2 CFGR2 peripheral PWR        */
#define LL_GTZC2_GRP2_RCC        GTZC_CFGR2_RCC_Msk        /*!< LL GTZC2 CFGR2 peripheral RCC        */
#define LL_GTZC2_GRP2_LPDMA1     GTZC_CFGR2_LPDMA1_Msk     /*!< LL GTZC2 CFGR2 peripheral LPDMA1     */
#define LL_GTZC2_GRP2_EXTI       GTZC_CFGR2_EXTI_Msk       /*!< LL GTZC2 CFGR2 peripheral EXTI       */
#define LL_GTZC2_GRP2_TZSC2      GTZC_CFGR2_TZSC2_Msk      /*!< LL GTZC2 CFGR2 peripheral TZSC2      */
#define LL_GTZC2_GRP2_TZIC2      GTZC_CFGR2_TZIC2_Msk      /*!< LL GTZC2 CFGR2 peripheral TZIC2      */
#define LL_GTZC2_GRP2_SRAM4      GTZC_CFGR2_SRAM4_Msk      /*!< LL GTZC2 CFGR2 peripheral SRAM4      */
#define LL_GTZC2_GRP2_MPCBB4_REG GTZC_CFGR2_MPCBB4_REG_Msk /*!< LL GTZC2 CFGR2 peripheral MPCBB4_REG */
#define LL_GTZC2_GRP2_ALL        0x0300C07FU               /*!< LL GTZC2 CFGR2 ALL peripherals       */
/**
  * @}
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/** @defgroup GTZC_LL_EC_WatermarkSubRegionSelection Watermark Subregion Selection
  * @{
  */
#define LL_GTZC_TZSC_MPCWM_SUBREGION_A 0x00U /*!< LL GTZC TZSC Watermark subregion A */
#define LL_GTZC_TZSC_MPCWM_SUBREGION_B 0x01U /*!< LL GTZC TZSC Watermark subregion B */
/**
  * @}
  */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/** @defgroup GTZC_LL_EC_PrivilegeAttributesSelection Privilege Attributes Selection
  * @{
  */
#define LL_GTZC_ATTR_NPRIV 0x00U /*!< LL GTZC Attribute non-privilege */
#define LL_GTZC_ATTR_PRIV  0x01U /*!< LL GTZC Attribute privilege     */
/**
  * @}
  */

/** @defgroup GTZC_LL_EC_SecurityAttributesSelection Security Attributes Selection
  * @{
  */
#define LL_GTZC_ATTR_NSEC 0x00U /*!< LL GTZC Attribute non-secure    */
#define LL_GTZC_ATTR_SEC  0x01U /*!< LL GTZC Attribute secure        */
/**
  * @}
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/** @defgroup GTZC_LL_EC_ClockSecurityInversion Clock Security Inversion
  * @{
  */
#define LL_GTZC_MPCBB_CLK_SEC_NOT_INVERTED 0x00U /*!< LL GTZC MPCBB Clock security not inverted */
#define LL_GTZC_MPCBB_CLK_SEC_INVERTED     0x01U /*!< LL GTZC MPCBB Clock security inverted     */
/**
  * @}
  */

/** @defgroup GTZC_LL_EC_SecureAccessState Secure Access State
  * @{
  */
#define LL_GTZC_MPCBB_SEC_ACCESS_NOT_ALLOWED 0x00 /*!< LL GTZC MPCBB SECURE ACCESS NOT ALLOWED */
#define LL_GTZC_MPCBB_SEC_ACCESS_ALLOWED     0x01 /*!< LL GTZC MPCBB SECURE ACCESS ALLOWED     */
/**
  * @}
  */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/** @defgroup GTZC_LL_EC_MPCBB_Super_Block_Attr_Selection MPCBB Super Block Attr Selection
  * @{
  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_0  0U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 0  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_1  1U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 1  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_2  2U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 2  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_3  3U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 3  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_4  4U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 4  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_5  5U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 5  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_6  6U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 6  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_7  7U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 7  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_8  8U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 8  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_9  9U  /*!< LL GTZC MPCBB SUPER BLOCK ATTR 9  */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_10 10U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 10 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_11 11U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 11 */
#if defined (SRAM3_BASE)
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_12 12U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 12 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_13 13U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 13 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_14 14U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 14 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_15 15U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 15 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_16 16U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 16 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_17 17U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 17 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_18 18U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 18 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_19 19U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 19 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_20 20U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 20 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_21 21U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 21 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_22 22U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 22 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_23 23U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 23 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_24 24U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 24 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_25 25U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 25 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_26 26U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 26 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_27 27U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 27 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_28 28U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 28 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_29 29U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 29 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_30 30U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 30 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_31 31U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 31 */
#endif /* SRAM3_BASE */
#if defined (SRAM5_BASE)
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_32 32U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 32 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_33 33U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 33 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_34 34U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 34 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_35 35U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 35 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_36 36U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 36 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_37 37U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 37 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_38 38U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 38 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_39 39U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 39 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_40 40U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 40 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_41 41U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 41 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_42 42U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 42 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_43 43U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 43 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_44 44U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 44 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_45 45U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 45 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_46 46U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 46 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_47 47U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 47 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_48 48U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 48 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_49 49U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 49 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_50 50U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 50 */
#define LL_GTZC_MPCBB_SUPERBLK_ATTR_51 51U /*!< LL GTZC MPCBB SUPER BLOCK ATTR 51 */
#endif /* SRAM5_BASE */
/**
  * @}
  */

/** @defgroup GTZC_LL_EC_MPCBB_Super_Block_Lock_Selection MPCBB Super Block Lock Selection
  * @{
  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_0   GTZC_MPCBB_CFGLOCKR1_SPLCK0_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 0  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_1   GTZC_MPCBB_CFGLOCKR1_SPLCK1_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 1  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_2   GTZC_MPCBB_CFGLOCKR1_SPLCK2_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 2  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_3   GTZC_MPCBB_CFGLOCKR1_SPLCK3_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 3  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_4   GTZC_MPCBB_CFGLOCKR1_SPLCK4_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 4  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_5   GTZC_MPCBB_CFGLOCKR1_SPLCK5_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 5  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_6   GTZC_MPCBB_CFGLOCKR1_SPLCK6_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 6  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_7   GTZC_MPCBB_CFGLOCKR1_SPLCK7_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 7  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_8   GTZC_MPCBB_CFGLOCKR1_SPLCK8_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 8  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_9   GTZC_MPCBB_CFGLOCKR1_SPLCK9_Msk  /*!< LL GTZC MPCBB SUPER BLOCK LOCK 9  */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_10  GTZC_MPCBB_CFGLOCKR1_SPLCK10_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 10 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_11  GTZC_MPCBB_CFGLOCKR1_SPLCK11_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 11 */
#if defined (SRAM3_BASE)
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_12  GTZC_MPCBB_CFGLOCKR1_SPLCK12_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 12 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_13  GTZC_MPCBB_CFGLOCKR1_SPLCK13_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 13 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_14  GTZC_MPCBB_CFGLOCKR1_SPLCK14_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 14 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_15  GTZC_MPCBB_CFGLOCKR1_SPLCK15_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 15 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_16  GTZC_MPCBB_CFGLOCKR1_SPLCK16_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 16 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_17  GTZC_MPCBB_CFGLOCKR1_SPLCK17_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 17 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_18  GTZC_MPCBB_CFGLOCKR1_SPLCK18_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 18 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_19  GTZC_MPCBB_CFGLOCKR1_SPLCK19_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 19 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_20  GTZC_MPCBB_CFGLOCKR1_SPLCK20_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 20 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_21  GTZC_MPCBB_CFGLOCKR1_SPLCK21_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 21 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_22  GTZC_MPCBB_CFGLOCKR1_SPLCK22_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 22 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_23  GTZC_MPCBB_CFGLOCKR1_SPLCK23_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 23 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_24  GTZC_MPCBB_CFGLOCKR1_SPLCK24_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 24 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_25  GTZC_MPCBB_CFGLOCKR1_SPLCK25_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 25 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_26  GTZC_MPCBB_CFGLOCKR1_SPLCK26_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 26 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_27  GTZC_MPCBB_CFGLOCKR1_SPLCK27_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 27 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_28  GTZC_MPCBB_CFGLOCKR1_SPLCK28_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 28 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_29  GTZC_MPCBB_CFGLOCKR1_SPLCK29_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 29 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_30  GTZC_MPCBB_CFGLOCKR1_SPLCK30_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 30 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_31  GTZC_MPCBB_CFGLOCKR1_SPLCK31_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 31 */
#endif /* SRAM3_BASE */
#if defined (SRAM5_BASE)
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_32  GTZC_MPCBB_CFGLOCKR2_SPLCK32_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 32 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_33  GTZC_MPCBB_CFGLOCKR2_SPLCK33_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 33 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_34  GTZC_MPCBB_CFGLOCKR2_SPLCK34_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 34 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_35  GTZC_MPCBB_CFGLOCKR2_SPLCK35_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 35 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_36  GTZC_MPCBB_CFGLOCKR2_SPLCK36_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 36 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_37  GTZC_MPCBB_CFGLOCKR2_SPLCK37_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 37 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_38  GTZC_MPCBB_CFGLOCKR2_SPLCK38_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 38 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_39  GTZC_MPCBB_CFGLOCKR2_SPLCK39_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 39 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_40  GTZC_MPCBB_CFGLOCKR2_SPLCK40_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 40 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_41  GTZC_MPCBB_CFGLOCKR2_SPLCK41_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 41 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_42  GTZC_MPCBB_CFGLOCKR2_SPLCK42_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 42 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_43  GTZC_MPCBB_CFGLOCKR2_SPLCK43_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 43 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_44  GTZC_MPCBB_CFGLOCKR2_SPLCK44_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 44 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_45  GTZC_MPCBB_CFGLOCKR2_SPLCK45_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 45 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_46  GTZC_MPCBB_CFGLOCKR2_SPLCK46_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 46 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_47  GTZC_MPCBB_CFGLOCKR2_SPLCK47_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 47 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_48  GTZC_MPCBB_CFGLOCKR2_SPLCK48_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 48 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_49  GTZC_MPCBB_CFGLOCKR2_SPLCK49_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 49 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_50  GTZC_MPCBB_CFGLOCKR2_SPLCK50_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 50 */
#define LL_GTZC_MPCBB_SUPERBLK_LOCK_51  GTZC_MPCBB_CFGLOCKR2_SPLCK51_Msk /*!< LL GTZC MPCBB SUPER BLOCK LOCK 51 */
#endif /* SRAM5_BASE */
/**
  * @}
  */

/** @defgroup GTZC_LL_EC_MPCBB_Block_Selection MPCBB Block Selection
  * @{
  */
#define LL_GTZC_MPCBB_BLK_0  0x00000001U /*!< LL GTZC MPCBB BLOCK 0  */
#define LL_GTZC_MPCBB_BLK_1  0x00000002U /*!< LL GTZC MPCBB BLOCK 1  */
#define LL_GTZC_MPCBB_BLK_2  0x00000004U /*!< LL GTZC MPCBB BLOCK 2  */
#define LL_GTZC_MPCBB_BLK_3  0x00000008U /*!< LL GTZC MPCBB BLOCK 3  */
#define LL_GTZC_MPCBB_BLK_4  0x00000010U /*!< LL GTZC MPCBB BLOCK 4  */
#define LL_GTZC_MPCBB_BLK_5  0x00000020U /*!< LL GTZC MPCBB BLOCK 5  */
#define LL_GTZC_MPCBB_BLK_6  0x00000040U /*!< LL GTZC MPCBB BLOCK 6  */
#define LL_GTZC_MPCBB_BLK_7  0x00000080U /*!< LL GTZC MPCBB BLOCK 7  */
#define LL_GTZC_MPCBB_BLK_8  0x00000100U /*!< LL GTZC MPCBB BLOCK 8  */
#define LL_GTZC_MPCBB_BLK_9  0x00000200U /*!< LL GTZC MPCBB BLOCK 9  */
#define LL_GTZC_MPCBB_BLK_10 0x00000400U /*!< LL GTZC MPCBB BLOCK 10 */
#define LL_GTZC_MPCBB_BLK_11 0x00000800U /*!< LL GTZC MPCBB BLOCK 11 */
#if defined (SRAM3_BASE)
#define LL_GTZC_MPCBB_BLK_12 0x00001000U /*!< LL GTZC MPCBB BLOCK 12 */
#define LL_GTZC_MPCBB_BLK_13 0x00002000U /*!< LL GTZC MPCBB BLOCK 13 */
#define LL_GTZC_MPCBB_BLK_14 0x00004000U /*!< LL GTZC MPCBB BLOCK 14 */
#define LL_GTZC_MPCBB_BLK_15 0x00008000U /*!< LL GTZC MPCBB BLOCK 15 */
#define LL_GTZC_MPCBB_BLK_16 0x00010000U /*!< LL GTZC MPCBB BLOCK 16 */
#define LL_GTZC_MPCBB_BLK_17 0x00020000U /*!< LL GTZC MPCBB BLOCK 17 */
#define LL_GTZC_MPCBB_BLK_18 0x00040000U /*!< LL GTZC MPCBB BLOCK 18 */
#define LL_GTZC_MPCBB_BLK_19 0x00080000U /*!< LL GTZC MPCBB BLOCK 19 */
#define LL_GTZC_MPCBB_BLK_20 0x00100000U /*!< LL GTZC MPCBB BLOCK 20 */
#define LL_GTZC_MPCBB_BLK_21 0x00200000U /*!< LL GTZC MPCBB BLOCK 21 */
#define LL_GTZC_MPCBB_BLK_22 0x00400000U /*!< LL GTZC MPCBB BLOCK 22 */
#define LL_GTZC_MPCBB_BLK_23 0x00800000U /*!< LL GTZC MPCBB BLOCK 23 */
#define LL_GTZC_MPCBB_BLK_24 0x01000000U /*!< LL GTZC MPCBB BLOCK 24 */
#define LL_GTZC_MPCBB_BLK_25 0x02000000U /*!< LL GTZC MPCBB BLOCK 25 */
#define LL_GTZC_MPCBB_BLK_26 0x04000000U /*!< LL GTZC MPCBB BLOCK 26 */
#define LL_GTZC_MPCBB_BLK_27 0x08000000U /*!< LL GTZC MPCBB BLOCK 27 */
#define LL_GTZC_MPCBB_BLK_28 0x10000000U /*!< LL GTZC MPCBB BLOCK 28 */
#define LL_GTZC_MPCBB_BLK_29 0x20000000U /*!< LL GTZC MPCBB BLOCK 29 */
#define LL_GTZC_MPCBB_BLK_30 0x40000000U /*!< LL GTZC MPCBB BLOCK 30 */
#define LL_GTZC_MPCBB_BLK_31 0x80000000U /*!< LL GTZC MPCBB BLOCK 31 */
#endif /* SRAM3_BASE */
/**
  * @}
  */

/**
  * @}
  */

