STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup GTZC_LL_Exported_Macros GTZC Exported Macros
  * @{
  */

/**
  * @brief  Write a value in GTZC register.
  * @param  instance GTZC Instance.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  */
#define LL_GTZC_WRITE_REG(instance, reg, value) WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in GTZC register
  * @param  instance GTZC Instance
  * @param  reg      Register to be read
  * @retval Register value
  */
#define LL_GTZC_READ_REG(instance, reg) READ_REG((instance)->reg)
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup GTZC_LL_Exported_Functions GTZC Exported Functions
  * @{
  */

/** @defgroup GTZC_TZSC_LL_EF_Management GTZC TZSC Management
  * @{
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock of peripheral attributes.
  * @rmtoll
  *  CR           LCK         LL_GTZC_TZSC_LockPeriphAttr
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  */
__STATIC_INLINE void LL_GTZC_TZSC_LockPeriphAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc)
{
  SET_BIT(p_tzsc->CR, GTZC_TZSC_CR_LCK_Msk);
}

/**
  * @brief  Check if peripheral attributes is locked.
  * @rmtoll
  *  CR           LCK         LL_GTZC_TZSC_IsLockedPeriphAttr
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @retval State of parameter value (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_IsLockedPeriphAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc)
{
  return ((READ_BIT(p_tzsc->CR, GTZC_TZSC_CR_LCK_Msk) == GTZC_TZSC_CR_LCK_Msk) ? 1UL : 0UL);
}

/**
  * @brief  Set SECCFGR1 peripherals security attribute.
  * @rmtoll
  *  SECCFGR1           xxxSEC         LL_GTZC_TZSC_SetSecurityAttribute_SECCFGR1
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  * @param  attr This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_NSEC
  *         @arg @ref LL_GTZC_ATTR_SEC
  */
__STATIC_INLINE void LL_GTZC_TZSC_SetPeriphGrp1SecurityAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                            uint32_t periph,
                                                            uint32_t attr)
{
  ATOMIC_MODIFY_REG(p_tzsc->SECCFGR1, periph, (attr * periph));
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get SECCFGR1 peripheral security attribute.
  * @rmtoll
  *  SECCFGR1           xxxSEC         LL_GTZC_TZSC_GetSecurityAttribute_SECCFGR1
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  * @retval State of bit (0 Non-secure / 1 Secure)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_GetPeriphGrp1SecurityAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                                uint32_t periph)
{
  return (READ_BIT(p_tzsc->SECCFGR1, periph));
}

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set SECCFGR2 peripherals security attribute.
  * @rmtoll
  *  SECCFGR2           xxxSEC         LL_GTZC_TZSC_SetSecurityAttribute_SECCFGR2
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  * @param  attr This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_NSEC
  *         @arg @ref LL_GTZC_ATTR_SEC
  */
__STATIC_INLINE void LL_GTZC_TZSC_SetPeriphGrp2SecurityAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                            uint32_t periph,
                                                            uint32_t attr)
{
  ATOMIC_MODIFY_REG(p_tzsc->SECCFGR2, periph, (attr * periph));
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get SECCFGR2 peripherals security attribute.
  * @rmtoll
  *  SECCFGR2           xxxSEC         LL_GTZC_TZSC_GetSecurityAttribute_SECCFGR2
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  * @retval State of bit (0 Non-secure / 1 Secure)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_GetPeriphGrp2SecurityAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                                uint32_t periph)
{
  return (READ_BIT(p_tzsc->SECCFGR2, periph));
}

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set SECCFGR3 peripherals security attribute.
  * @rmtoll
  *  SECCFGR3           xxxSEC         LL_GTZC_TZSC_SetSecurityAttribute_SECCFGR3
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  * @param  attr This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_NSEC
  *         @arg @ref LL_GTZC_ATTR_SEC
  */
__STATIC_INLINE void LL_GTZC_TZSC_SetPeriphGrp3SecurityAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                            uint32_t periph,
                                                            uint32_t attr)
{
  ATOMIC_MODIFY_REG(p_tzsc->SECCFGR3, periph, (attr * periph));
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get SECCFGR3 peripherals security attribute.
  * @rmtoll
  *  SECCFGR3           xxxSEC         LL_GTZC_TZSC_GetSecurityAttribute_SECCFGR3
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  * @retval State of bit (0 Non-secure / 1 Secure)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_GetPeriphGrp3SecurityAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                                uint32_t periph)
{
  return (READ_BIT(p_tzsc->SECCFGR3, periph));
}

/**
  * @brief  Set PRIVCFGR1 peripherals privilege attribute.
  * @rmtoll
  *  PRIVCFGR1           xxxPRIV         LL_GTZC_TZSC_SetPrivilegeAttribute_PRIVCFGR1
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  * @param  attr This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  *         @arg @ref LL_GTZC_ATTR_PRIV
  */
__STATIC_INLINE void LL_GTZC_TZSC_SetPeriphGrp1PrivilegeAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                             uint32_t periph,
                                                             uint32_t attr)
{
  ATOMIC_MODIFY_REG(p_tzsc->PRIVCFGR1, periph, (attr * periph));
}

/**
  * @brief  Get PRIVCFGR1 peripheral privilege attribute.
  * @rmtoll
  *  PRIVCFGR1           xxxPRIV         LL_GTZC_TZSC_GetPrivilegeAttribute_PRIVCFGR1
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  * @retval State of bit (0 Non-privilege / 1 Privilege)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_GetPeriphGrp1PrivilegeAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                                 uint32_t periph)
{
  return (READ_BIT(p_tzsc->PRIVCFGR1, periph));
}

/**
  * @brief  Set PRIVCFGR2 peripheral privilege attribute.
  * @rmtoll
  *  PRIVCFGR2           xxxPRIV         LL_GTZC_TZSC_SetPrivilegeAttribute_PRIVCFGR2
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  * @param  attr This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  *         @arg @ref LL_GTZC_ATTR_PRIV
  */
__STATIC_INLINE void LL_GTZC_TZSC_SetPeriphGrp2PrivilegeAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                             uint32_t periph,
                                                             uint32_t attr)
{
  ATOMIC_MODIFY_REG(p_tzsc->PRIVCFGR2, periph, (attr * periph));
}

/**
  * @brief  Get PRIVCFGR2 peripheral privilege attribute.
  * @rmtoll
  *  PRIVCFGR2           xxxPRIV         LL_GTZC_TZSC_GetPrivilegeAttribute_PRIVCFGR2
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  * @retval State of bit (0 Non-privilege / 1 Privilege)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_GetPeriphGrp2PrivilegeAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                                 uint32_t periph)
{
  return (READ_BIT(p_tzsc->PRIVCFGR2, periph));
}

