STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/**
  * @brief  Set PRIVCFGR3 peripheral privilege attribute.
  * @rmtoll
  *  PRIVCFGR3           xxxPRIV         LL_GTZC_TZSC_SetPrivilegeAttribute_PRIVCFGR3
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  * @param  attr This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  *         @arg @ref LL_GTZC_ATTR_PRIV
  */
__STATIC_INLINE void LL_GTZC_TZSC_SetPeriphGrp3PrivilegeAttr(GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                             uint32_t periph,
                                                             uint32_t attr)
{
  ATOMIC_MODIFY_REG(p_tzsc->PRIVCFGR3, periph, (attr * periph));
}

/**
  * @brief  Get PRIVCFGR3 peripheral privilege attribute.
  * @rmtoll
  *  PRIVCFGR3           xxxPRIV         LL_GTZC_TZSC_GetPrivilegeAttribute_PRIVCFGR3
  * @param  p_tzsc TZSC Instance
  * @if GTZC_TZSC1
  *         @arg @ref GTZC1_TZSC1_SEC_PERIPH
  * @endif
  * @if GTZC_TZSC2
  *         @arg @ref GTZC2_TZSC1_SEC_PERIPH
  * @endif
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  * @retval State of bit (0 Non-privilege / 1 Privilege)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_GetPeriphGrp3PrivilegeAttr(const GTZC_TZSC_SecPeriph_TypeDef *p_tzsc,
                                                                 uint32_t periph)
{
  return (READ_BIT(p_tzsc->PRIVCFGR3, periph));
}

/**
  * @}
  */

/** @defgroup GTZC_TZSC_MPCWM_LL_EF_Management MPCWM Management
  * @{
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable subregion of watermark memory.
  * @rmtoll
  *  MPCWMxzCFGR           SREN         LL_GTZC_TZSC_MPCWM_EnableSubRegion
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_EnableSubRegion(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                        uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  SET_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SREN);
}

/**
  * @brief  Disable subregion of watermark memory.
  * @rmtoll
  *  MPCWMxzCFGR           SREN         LL_GTZC_TZSC_MPCWM_DisableSubRegion
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_DisableSubRegion(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                         uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  CLEAR_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SREN);
}

/**
  * @brief  Check if subregion of watermark is enabled.
  * @rmtoll
  *  MPCWMxzCFGR           SREN         LL_GTZC_TZSC_MPCWM_IsEnabledSubRegion
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  *
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_MPCWM_IsEnabledSubRegion(const GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                               uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  return ((READ_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SREN) ==
           GTZC_TZSC_MPCWM_CFGR_SREN) ? 1UL : 0UL);
}

/**
  * @brief  Lock of subregion of watermark memory.
  * @rmtoll
  *  MPCWMxzCFGR           SRLOCK         LL_GTZC_TZSC_MPCWM_LockSubRegion
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_LockSubRegion(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                      uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  SET_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SRLOCK);
}

/**
  * @brief  Check if subregion of watermark is locked.
  * @rmtoll
  *  MPCWMxzCFGR           SRLOCK         LL_GTZC_TZSC_MPCWM_IsLockedSubRegion
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_MPCWM_IsLockedSubRegion(const GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                              uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  return ((READ_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SRLOCK) ==
           GTZC_TZSC_MPCWM_CFGR_SRLOCK) ? 1UL : 0UL);
}

/**
  * @brief  Set watermark memory subregion attribute.
  * @rmtoll
  *  MPCWMxzCFGR           SEC         LL_GTZC_TZSC_MPCWM_SetSubRegionAttr
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @param sec_attr
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_ATTR_SEC
  *         @arg @ref LL_GTZC_ATTR_NSEC
  * @param  priv_attr
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_ATTR_PRIV
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_SetSubRegionAttr(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                         uint32_t subregion,
                                                         uint32_t sec_attr,
                                                         uint32_t priv_attr)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + (8U * subregion)), (GTZC_TZSC_MPCWM_CFGR_SEC | GTZC_TZSC_MPCWM_CFGR_PRIV),
             ((sec_attr << GTZC_TZSC_MPCWM_CFGR_SEC_Pos) | (priv_attr << GTZC_TZSC_MPCWM_CFGR_PRIV_Pos)));
}

/**
  * @brief  Set secure attribute of watermark memory subregion.
  * @rmtoll
  *  MPCWMxzCFGR           SEC         LL_GTZC_TZSC_MPCWM_SetSubRegionSecure
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @param  sec_attr
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_ATTR_SEC
  *         @arg @ref LL_GTZC_ATTR_NSEC
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_SetSubRegionSecure(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                           uint32_t subregion,
                                                           uint32_t sec_attr)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SEC,
             (GTZC_TZSC_MPCWM_CFGR_SEC * sec_attr));
}

/**
  * @brief  Get secure attribute of watermark memory subregion.
  * @rmtoll
  *  MPCWMxzCFGR           SEC         LL_GTZC_TZSC_MPCWM_GetSubRegionSecure
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_SEC
  *         @arg @ref LL_GTZC_ATTR_NSEC
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_MPCWM_GetSubRegionSecure(const GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                               uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  return (READ_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_SEC));
}

/**
  * @brief  Set privilege attribute of watermark memory subregion.
  * @rmtoll
  *  MPCWMxzCFGR           PRIV         LL_GTZC_TZSC_MPCWM_SetSubRegionPrivilege
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @param  priv_attr
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_ATTR_PRIV
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_SetSubRegionPrivilege(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                              uint32_t subregion,
                                                              uint32_t priv_attr)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_PRIV,
             (GTZC_TZSC_MPCWM_CFGR_PRIV * priv_attr));
}

/**
  * @brief  Get privilege attribute of watermark memory subregion.
  * @rmtoll
  *  MPCWMxzCFGR           PRIV         LL_GTZC_TZSC_MPCWM_GetSubRegionPrivilege
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GTZC_ATTR_PRIV
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_MPCWM_GetSubRegionPrivilege(const GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                                  uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t)p_watermark;
  return (READ_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWM_CFGR_PRIV));
}

/**
  * @brief  Set area configuration of watermark memory subregion.
  * @rmtoll
  *  MPCWMxAR           SUBx_START/SUBx_LENGTH        LL_GTZC_TZSC_MPCWM_ConfigSubRegionArea
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @param start  : address in byte divided by granularity
  * @param length : length in byte divided by granularity
  *
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_ConfigSubRegionArea(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                            uint32_t subregion,
                                                            uint32_t start,
                                                            uint32_t length)
{
  uint32_t reg_addr = (uint32_t) &(p_watermark->MPCWMxAR);
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + (8U * subregion)),
             (GTZC_TZSC_MPCWMR_SUBZ_START | GTZC_TZSC_MPCWMR_SUBZ_LENGTH), (start | (length << 16U)));
}

/**
  * @brief  Set start of subregion of watermark memory.
  * @rmtoll
  *  MPCWMxAR           SUBx_START       LL_GTZC_TZSC_MPCWM_SetSubRegionStart
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @param start  : address in byte divided by granularity
  *
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_SetSubRegionStart(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                          uint32_t subregion,
                                                          uint32_t start)
{
  uint32_t reg_addr = (uint32_t) &(p_watermark->MPCWMxAR);
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWMR_SUBZ_START, start);
}

/**
  * @brief  Get start of subregion of watermark memory.
  * @rmtoll
  *  MPCWMxAR           SUBx_START          LL_GTZC_TZSC_MPCWM_GetSubRegionStart
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @retval Returned value
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_MPCWM_GetSubRegionStart(const GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                              uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t) &(p_watermark->MPCWMxAR);
  return (READ_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWMR_SUBZ_START));
}

/**
  * @brief  Set length of subregion of watermark memory.
  * @rmtoll
  *  MPCWMxAR           SUBx_LENGTH       LL_GTZC_TZSC_MPCWM_SetSubRegionLength
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @param length  : length in byte divided by granularity
  *
  */
__STATIC_INLINE void LL_GTZC_TZSC_MPCWM_SetSubRegionLength(GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                           uint32_t subregion,
                                                           uint32_t length)
{
  uint32_t reg_addr = (uint32_t) &(p_watermark->MPCWMxAR);
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWMR_SUBZ_LENGTH, (length << 16U));
}

