STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/**
  * @brief  Get length of subregion of watermark memory.
  * @rmtoll
  *  MPCWMxAR           SUBx_LENGTH          LL_GTZC_TZSC_MPCWM_GetSubRegionLength
  * @param  p_watermark WATERMARK Instance
  * @if GTZC1_TZSC1_MPCWM1
  *         @arg @ref GTZC1_TZSC1_MPCWM1
  * @endif
  * @if FMC_BASE
  *         @arg @ref GTZC1_TZSC1_MPCWM2
  *         @arg @ref GTZC1_TZSC1_MPCWM3
  * @endif
  * @if GTZC1_TZSC1_MPCWM4
  *         @arg @ref GTZC1_TZSC1_MPCWM4
  * @endif
  * @if OCTOSPI2
  *         @arg @ref GTZC1_TZSC1_MPCWM5
  * @endif
  * @if HSPI1
  *         @arg @ref GTZC1_TZSC1_MPCWM6
  * @endif
  * @param  subregion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_A
  *         @arg @ref LL_GTZC_TZSC_MPCWM_SUBREGION_B
  * @retval Returned value
  */
__STATIC_INLINE uint32_t LL_GTZC_TZSC_MPCWM_GetSubRegionLength(const GTZC_TZSC_WaterMark_TypeDef *p_watermark,
                                                               uint32_t subregion)
{
  uint32_t reg_addr = (uint32_t) &(p_watermark->MPCWMxAR);
  return (READ_BIT(*(__IO uint32_t *)(reg_addr + (8U * subregion)), GTZC_TZSC_MPCWMR_SUBZ_LENGTH));
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @}
  */

/** @defgroup GTZC_LL_EF_MPCBB_Management MPCBB Management
  * @{
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set clock security state of block based memory.
  * @rmtoll
  *  CR           INVSECSTATE        LL_GTZC_MPCBB_SetClockSecurityState
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  clk_sec_state
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_MPCBB_CLK_SEC_NOT_INVERTED
  *         @arg @ref LL_GTZC_MPCBB_CLK_SEC_INVERTED
  */
__STATIC_INLINE void LL_GTZC_MPCBB_SetClockSecurityState(GTZC_BlockBased_TypeDef *p_blockbased, uint32_t clk_sec_state)
{
  MODIFY_REG(p_blockbased->CR, GTZC_MPCBB_CR_INVSECSTATE_Msk, (GTZC_MPCBB_CR_INVSECSTATE_Msk * clk_sec_state));
}

/**
  * @brief  Get clock security state of block based memory.
  * @rmtoll
  *  CR           INVSECSTATE         LL_GTZC_MPCBB_GetClockSecurityState
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GTZC_MPCBB_CLK_SEC_NOT_INVERTED
  *         @arg @ref LL_GTZC_MPCBB_CLK_SEC_INVERTED
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_GetClockSecurityState(const GTZC_BlockBased_TypeDef *p_blockbased)
{
  return (READ_BIT(p_blockbased->CR, GTZC_MPCBB_CR_INVSECSTATE_Msk) >> GTZC_MPCBB_CR_INVSECSTATE_Pos);
}

/**
  * @brief  Set secure access state of block based memory.
  * @rmtoll
  *  CR            SRWILADIS         LL_GTZC_MPCBB_SetSecureAccessState
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  sec_access_state
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SEC_ACCESS_ALLOWED
  *         @arg @ref LL_GTZC_MPCBB_SEC_ACCESS_NOT_ALLOWED
  */
__STATIC_INLINE void LL_GTZC_MPCBB_SetSecureAccessState(GTZC_BlockBased_TypeDef *p_blockbased,
                                                        uint32_t sec_access_state)
{
  MODIFY_REG(p_blockbased->CR, GTZC_MPCBB_CR_SRWILADIS_Msk, (GTZC_MPCBB_CR_SRWILADIS_Msk * sec_access_state));
}

/**
  * @brief  Get secure access state of block based memory.
  * @rmtoll
  *  CR           SRWILADIS         LL_GTZC_MPCBB_GetSecureAccessState
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GTZC_MPCBB_SEC_ACCESS_ALLOWED
  *         @arg @ref LL_GTZC_MPCBB_SEC_ACCESS_NOT_ALLOWED
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_GetSecureAccessState(const GTZC_BlockBased_TypeDef *p_blockbased)
{
  return (READ_BIT(p_blockbased->CR, GTZC_MPCBB_CR_SRWILADIS_Msk) >> GTZC_MPCBB_CR_SRWILADIS_Pos);
}

/**
  * @brief  Set secure attribute of blk memory.
  * @rmtoll
  *  SECCFGRx (x= 0 to 51)     SECx (x= 0 to 31)     LL_GTZC_MPCBB_SetBlkSecure
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  super_blk
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_0
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_1
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_2
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_3
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_4
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_5
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_6
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_7
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_8
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_9
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_10
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_12
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_13
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_14
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_15
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_16
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_17
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_18
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_19
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_20
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_21
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_22
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_23
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_24
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_25
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_26
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_27
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_28
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_29
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_30
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_31
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_32
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_33
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_34
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_35
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_36
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_37
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_38
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_39
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_40
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_41
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_42
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_43
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_44
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_45
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_46
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_47
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_48
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_49
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_50
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_51
  * @endif
  * @param  blk
  *         This parameter can be a combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_BLK_0
  *         @arg @ref LL_GTZC_MPCBB_BLK_1
  *         @arg @ref LL_GTZC_MPCBB_BLK_2
  *         @arg @ref LL_GTZC_MPCBB_BLK_3
  *         @arg @ref LL_GTZC_MPCBB_BLK_4
  *         @arg @ref LL_GTZC_MPCBB_BLK_5
  *         @arg @ref LL_GTZC_MPCBB_BLK_6
  *         @arg @ref LL_GTZC_MPCBB_BLK_7
  *         @arg @ref LL_GTZC_MPCBB_BLK_8
  *         @arg @ref LL_GTZC_MPCBB_BLK_9
  *         @arg @ref LL_GTZC_MPCBB_BLK_10
  *         @arg @ref LL_GTZC_MPCBB_BLK_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_BLK_12
  *         @arg @ref LL_GTZC_MPCBB_BLK_13
  *         @arg @ref LL_GTZC_MPCBB_BLK_14
  *         @arg @ref LL_GTZC_MPCBB_BLK_15
  *         @arg @ref LL_GTZC_MPCBB_BLK_16
  *         @arg @ref LL_GTZC_MPCBB_BLK_17
  *         @arg @ref LL_GTZC_MPCBB_BLK_18
  *         @arg @ref LL_GTZC_MPCBB_BLK_19
  *         @arg @ref LL_GTZC_MPCBB_BLK_20
  *         @arg @ref LL_GTZC_MPCBB_BLK_21
  *         @arg @ref LL_GTZC_MPCBB_BLK_22
  *         @arg @ref LL_GTZC_MPCBB_BLK_23
  *         @arg @ref LL_GTZC_MPCBB_BLK_24
  *         @arg @ref LL_GTZC_MPCBB_BLK_25
  *         @arg @ref LL_GTZC_MPCBB_BLK_26
  *         @arg @ref LL_GTZC_MPCBB_BLK_27
  *         @arg @ref LL_GTZC_MPCBB_BLK_28
  *         @arg @ref LL_GTZC_MPCBB_BLK_29
  *         @arg @ref LL_GTZC_MPCBB_BLK_30
  *         @arg @ref LL_GTZC_MPCBB_BLK_31
  * @endif
  * @param sec_attr
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_ATTR_SEC
  *         @arg @ref LL_GTZC_ATTR_NSEC
  */
__STATIC_INLINE void LL_GTZC_MPCBB_SetBlkSecure(GTZC_BlockBased_TypeDef *p_blockbased,
                                                uint32_t super_blk,
                                                uint32_t blk,
                                                uint32_t sec_attr)
{
  MODIFY_REG(p_blockbased->SECCFGR[super_blk], blk, (blk * sec_attr));
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get secure attribute of super-blk block based memory.
  * @rmtoll
  *  SECCFGRx (x= 0 to 51)     SECx (x= 0 to 31)     LL_GTZC_MPCBB_GetSuperBlkSecure
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  super_blk
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_0
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_1
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_2
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_3
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_4
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_5
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_6
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_7
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_8
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_9
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_10
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_12
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_13
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_14
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_15
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_16
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_17
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_18
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_19
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_20
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_21
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_22
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_23
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_24
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_25
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_26
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_27
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_28
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_29
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_30
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_31
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_32
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_33
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_34
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_35
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_36
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_37
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_38
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_39
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_40
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_41
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_42
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_43
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_44
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_45
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_46
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_47
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_48
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_49
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_50
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_51
  * @endif
  * @retval The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_BLK_0
  *         @arg @ref LL_GTZC_MPCBB_BLK_1
  *         @arg @ref LL_GTZC_MPCBB_BLK_2
  *         @arg @ref LL_GTZC_MPCBB_BLK_3
  *         @arg @ref LL_GTZC_MPCBB_BLK_4
  *         @arg @ref LL_GTZC_MPCBB_BLK_5
  *         @arg @ref LL_GTZC_MPCBB_BLK_6
  *         @arg @ref LL_GTZC_MPCBB_BLK_7
  *         @arg @ref LL_GTZC_MPCBB_BLK_8
  *         @arg @ref LL_GTZC_MPCBB_BLK_9
  *         @arg @ref LL_GTZC_MPCBB_BLK_10
  *         @arg @ref LL_GTZC_MPCBB_BLK_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_BLK_12
  *         @arg @ref LL_GTZC_MPCBB_BLK_13
  *         @arg @ref LL_GTZC_MPCBB_BLK_14
  *         @arg @ref LL_GTZC_MPCBB_BLK_15
  *         @arg @ref LL_GTZC_MPCBB_BLK_16
  *         @arg @ref LL_GTZC_MPCBB_BLK_17
  *         @arg @ref LL_GTZC_MPCBB_BLK_18
  *         @arg @ref LL_GTZC_MPCBB_BLK_19
  *         @arg @ref LL_GTZC_MPCBB_BLK_20
  *         @arg @ref LL_GTZC_MPCBB_BLK_21
  *         @arg @ref LL_GTZC_MPCBB_BLK_22
  *         @arg @ref LL_GTZC_MPCBB_BLK_23
  *         @arg @ref LL_GTZC_MPCBB_BLK_24
  *         @arg @ref LL_GTZC_MPCBB_BLK_25
  *         @arg @ref LL_GTZC_MPCBB_BLK_26
  *         @arg @ref LL_GTZC_MPCBB_BLK_27
  *         @arg @ref LL_GTZC_MPCBB_BLK_28
  *         @arg @ref LL_GTZC_MPCBB_BLK_29
  *         @arg @ref LL_GTZC_MPCBB_BLK_30
  *         @arg @ref LL_GTZC_MPCBB_BLK_31
  * @endif
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_GetSuperBlkSecure(const GTZC_BlockBased_TypeDef *p_blockbased,
                                                         uint32_t super_blk)
{
  return (READ_REG(p_blockbased->SECCFGR[super_blk]));
}

/**
  * @brief  Set privilege attribute of super-blk block based memory.
  * @rmtoll
  *  PRIVCFGRx (x= 0 to 31)     PRIVx (x= 0 to 31)     LL_GTZC_MPCBB_SetBlkPrivilege
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  super_blk
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_0
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_1
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_2
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_3
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_4
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_5
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_6
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_7
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_8
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_9
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_10
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_12
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_13
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_14
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_15
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_16
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_17
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_18
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_19
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_20
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_21
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_22
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_23
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_24
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_25
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_26
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_27
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_28
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_29
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_30
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_31
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_32
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_33
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_34
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_35
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_36
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_37
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_38
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_39
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_40
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_41
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_42
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_43
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_44
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_45
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_46
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_47
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_48
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_49
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_50
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_51
  * @endif
  * @param  blk
  *         This parameter can be a combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_BLK_0
  *         @arg @ref LL_GTZC_MPCBB_BLK_1
  *         @arg @ref LL_GTZC_MPCBB_BLK_2
  *         @arg @ref LL_GTZC_MPCBB_BLK_3
  *         @arg @ref LL_GTZC_MPCBB_BLK_4
  *         @arg @ref LL_GTZC_MPCBB_BLK_5
  *         @arg @ref LL_GTZC_MPCBB_BLK_6
  *         @arg @ref LL_GTZC_MPCBB_BLK_7
  *         @arg @ref LL_GTZC_MPCBB_BLK_8
  *         @arg @ref LL_GTZC_MPCBB_BLK_9
  *         @arg @ref LL_GTZC_MPCBB_BLK_10
  *         @arg @ref LL_GTZC_MPCBB_BLK_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_BLK_12
  *         @arg @ref LL_GTZC_MPCBB_BLK_13
  *         @arg @ref LL_GTZC_MPCBB_BLK_14
  *         @arg @ref LL_GTZC_MPCBB_BLK_15
  *         @arg @ref LL_GTZC_MPCBB_BLK_16
  *         @arg @ref LL_GTZC_MPCBB_BLK_17
  *         @arg @ref LL_GTZC_MPCBB_BLK_18
  *         @arg @ref LL_GTZC_MPCBB_BLK_19
  *         @arg @ref LL_GTZC_MPCBB_BLK_20
  *         @arg @ref LL_GTZC_MPCBB_BLK_21
  *         @arg @ref LL_GTZC_MPCBB_BLK_22
  *         @arg @ref LL_GTZC_MPCBB_BLK_23
  *         @arg @ref LL_GTZC_MPCBB_BLK_24
  *         @arg @ref LL_GTZC_MPCBB_BLK_25
  *         @arg @ref LL_GTZC_MPCBB_BLK_26
  *         @arg @ref LL_GTZC_MPCBB_BLK_27
  *         @arg @ref LL_GTZC_MPCBB_BLK_28
  *         @arg @ref LL_GTZC_MPCBB_BLK_29
  *         @arg @ref LL_GTZC_MPCBB_BLK_30
  *         @arg @ref LL_GTZC_MPCBB_BLK_31
  * @endif
  * @param  priv_attr
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_ATTR_PRIV
  *         @arg @ref LL_GTZC_ATTR_NPRIV
  */
__STATIC_INLINE void LL_GTZC_MPCBB_SetBlkPrivilege(GTZC_BlockBased_TypeDef *p_blockbased,
                                                   uint32_t super_blk,
                                                   uint32_t blk,
                                                   uint32_t priv_attr)
{
  MODIFY_REG(p_blockbased->PRIVCFGR[super_blk], blk, (blk * priv_attr));
}

