STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/**
  * @brief  Get privilege attribute of super-blk block based memory.
  * @rmtoll
  *  PRIVCFGRx (x = 0 to 51)     PRIVx (x = 0 to 31)     LL_GTZC_MPCBB_GetSuperBlkPrivilege
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  super_blk
  *         This parameter can be one of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_0
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_1
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_2
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_3
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_4
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_5
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_6
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_7
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_8
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_9
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_10
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_12
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_13
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_14
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_15
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_16
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_17
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_18
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_19
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_20
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_21
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_22
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_23
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_24
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_25
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_26
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_27
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_28
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_29
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_30
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_31
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_32
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_33
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_34
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_35
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_36
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_37
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_38
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_39
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_40
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_41
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_42
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_43
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_44
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_45
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_46
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_47
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_48
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_49
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_50
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_ATTR_51
  * @endif
  * @retval The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_BLK_0
  *         @arg @ref LL_GTZC_MPCBB_BLK_1
  *         @arg @ref LL_GTZC_MPCBB_BLK_2
  *         @arg @ref LL_GTZC_MPCBB_BLK_3
  *         @arg @ref LL_GTZC_MPCBB_BLK_4
  *         @arg @ref LL_GTZC_MPCBB_BLK_5
  *         @arg @ref LL_GTZC_MPCBB_BLK_6
  *         @arg @ref LL_GTZC_MPCBB_BLK_7
  *         @arg @ref LL_GTZC_MPCBB_BLK_8
  *         @arg @ref LL_GTZC_MPCBB_BLK_9
  *         @arg @ref LL_GTZC_MPCBB_BLK_10
  *         @arg @ref LL_GTZC_MPCBB_BLK_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_BLK_12
  *         @arg @ref LL_GTZC_MPCBB_BLK_13
  *         @arg @ref LL_GTZC_MPCBB_BLK_14
  *         @arg @ref LL_GTZC_MPCBB_BLK_15
  *         @arg @ref LL_GTZC_MPCBB_BLK_16
  *         @arg @ref LL_GTZC_MPCBB_BLK_17
  *         @arg @ref LL_GTZC_MPCBB_BLK_18
  *         @arg @ref LL_GTZC_MPCBB_BLK_19
  *         @arg @ref LL_GTZC_MPCBB_BLK_20
  *         @arg @ref LL_GTZC_MPCBB_BLK_21
  *         @arg @ref LL_GTZC_MPCBB_BLK_22
  *         @arg @ref LL_GTZC_MPCBB_BLK_23
  *         @arg @ref LL_GTZC_MPCBB_BLK_24
  *         @arg @ref LL_GTZC_MPCBB_BLK_25
  *         @arg @ref LL_GTZC_MPCBB_BLK_26
  *         @arg @ref LL_GTZC_MPCBB_BLK_27
  *         @arg @ref LL_GTZC_MPCBB_BLK_28
  *         @arg @ref LL_GTZC_MPCBB_BLK_29
  *         @arg @ref LL_GTZC_MPCBB_BLK_30
  *         @arg @ref LL_GTZC_MPCBB_BLK_31
  * @endif
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_GetSuperBlkPrivilege(const GTZC_BlockBased_TypeDef *p_blockbased,
                                                            uint32_t super_blk)
{
  return (READ_REG(p_blockbased->PRIVCFGR[super_blk]));
}

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock configuration of block based memory.
  * @rmtoll
  *  CR           GLOCK         LL_GTZC_MPCBB_LockConfig
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  */
__STATIC_INLINE void LL_GTZC_MPCBB_LockConfig(GTZC_BlockBased_TypeDef *p_blockbased)
{
  SET_BIT(p_blockbased->CR, GTZC_MPCBB_CR_GLOCK_Msk);
}

/**
  * @brief  Check if block based memory configuration is locked.
  * @rmtoll
  *  CR           GLOCK         LL_GTZC_MPCBB_IsLockedConfig
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_IsLockedConfig(const GTZC_BlockBased_TypeDef *p_blockbased)
{
  return ((READ_BIT(p_blockbased->CR, GTZC_MPCBB_CR_GLOCK_Msk) == GTZC_MPCBB_CR_GLOCK_Msk) ? 1UL : 0UL);
}

/**
  * @brief  Lock of super blk 0 to 31 of block based memory.
  * @rmtoll
  *  CFGLOCKR1           SPLCKx (x = 0 to 31)         LL_GTZC_MPCBB_LockSuperBlk_0_31
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  super_blk
  *         The parameter can be a combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_0
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_1
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_2
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_3
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_4
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_5
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_6
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_7
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_8
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_9
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_10
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_12
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_13
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_14
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_15
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_16
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_17
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_18
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_19
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_20
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_21
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_22
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_23
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_24
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_25
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_26
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_27
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_28
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_29
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_30
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_31
  * @endif
  */
__STATIC_INLINE void LL_GTZC_MPCBB_LockSuperBlk_0_31(GTZC_BlockBased_TypeDef *p_blockbased, uint32_t super_blk)
{
  SET_BIT(p_blockbased->CFGLOCKR1, super_blk);
}

/**
  * @brief  Get lock of super blk 0 to 31 of block based memory.
  * @rmtoll
  *  CFGLOCKR1           SPLCKx (x = 0 to 31)         LL_GTZC_MPCBB_GetLockedSuperBlk_0_31
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @retval The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_0
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_1
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_2
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_3
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_4
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_5
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_6
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_7
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_8
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_9
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_10
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_11
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_12
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_13
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_14
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_15
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_16
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_17
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_18
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_19
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_20
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_21
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_22
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_23
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_24
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_25
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_26
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_27
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_28
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_29
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_30
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_31
  * @endif
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_GetLockedSuperBlk_0_31(const GTZC_BlockBased_TypeDef *p_blockbased)
{
  return (READ_REG(p_blockbased->CFGLOCKR1));
}

#if defined (SRAM5_BASE)
/**
  * @brief  Lock of super blk 32 to 51 of block based memory.
  * @rmtoll
  *  CFGLOCKR1           SPLCKx (x = 32 to 51)         LL_GTZC_MPCBB_LockSuperBlk_32_51
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @param  super_blk
  *         The parameter can be a combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_32
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_33
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_34
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_35
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_36
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_37
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_38
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_39
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_40
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_41
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_42
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_43
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_44
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_45
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_46
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_47
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_48
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_49
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_50
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_51
  */
__STATIC_INLINE void LL_GTZC_MPCBB_LockSuperBlk_32_51(GTZC_BlockBased_TypeDef *p_blockbased, uint32_t super_blk)
{
  SET_BIT(p_blockbased->CFGLOCKR2, super_blk);
}

/**
  * @brief  Get lock of super blk 32 to 51 of block based memory.
  * @rmtoll
  *  CFGLOCKR1           SPLCKx (x = 32 to 51)         LL_GTZC_MPCBB_GetLockedSuperBlk_32_51
  * @param  p_blockbased BLOCKBASED Instance
  *         This parameter can be one of the following values :
  * @if GTZC1_MPCBB1
  *         @arg @ref GTZC1_MPCBB1
  * @endif
  * @if GTZC1_MPCBB2
  *         @arg @ref GTZC1_MPCBB2
  * @endif
  * @if SRAM3_BASE
  *         @arg @ref GTZC1_MPCBB3
  * @endif
  * @if GTZC2_MPCBB4
  *         @arg @ref GTZC2_MPCBB4
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref GTZC1_MPCBB5
  * @endif
  * @if SRAM6_BASE
  *         @arg @ref GTZC1_MPCBB6
  * @endif
  * @retval The return value can be a 0x00000000U or combination of the following values :
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_32
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_33
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_34
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_35
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_36
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_37
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_38
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_39
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_40
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_41
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_42
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_43
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_44
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_45
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_46
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_47
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_48
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_49
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_50
  *         @arg @ref LL_GTZC_MPCBB_SUPERBLK_LOCK_51
  */
__STATIC_INLINE uint32_t LL_GTZC_MPCBB_GetLockedSuperBlk_32_51(const GTZC_BlockBased_TypeDef *p_blockbased)
{
  return (READ_REG(p_blockbased->CFGLOCKR2));
}
#endif /* SRAM5_BASE */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @}
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/** @defgroup GTZC_LL_EF_TZIC_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable IER1 illegal access interrupt.
  * @rmtoll
  *  IER1           xxxIE         LL_GTZC_TZIC_EnableGrp1IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  */
__STATIC_INLINE void LL_GTZC_TZIC_EnableGrp1IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->IER1, periph);
}

/**
  * @brief  Disable IER1 illegal access interrupt.
  * @rmtoll
  *  IER1           xxxIE         LL_GTZC_TZIC_DisableGrp1IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  */
__STATIC_INLINE void LL_GTZC_TZIC_DisableGrp1IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_CLEAR_BIT(p_tzic->IER1, periph);
}

/**
  * @brief  Check if IER1 illegal access interrupt is enabled.
  * @rmtoll
  *  IER1           xxxIE         LL_GTZC_TZIC_IsEnabledGrp1IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  * @retval State of interrupt (0 Disabled / 1 Enabled).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsEnabledGrp1IT(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->IER1, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Enable IER2 illegal access interrupt.
  * @rmtoll
  *  IER2           xxxIE         LL_GTZC_TZIC_EnableGrp2IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP4_SYSCFG
  *         @arg @ref LL_GTZC2_GRP4_RTC
  *         @arg @ref LL_GTZC2_GRP4_TAMP
  *         @arg @ref LL_GTZC2_GRP4_PWR
  *         @arg @ref LL_GTZC2_GRP4_RCC
  *         @arg @ref LL_GTZC2_GRP4_LPDMA1
  *         @arg @ref LL_GTZC2_GRP4_EXTI
  *         @arg @ref LL_GTZC2_GRP4_TZSC2
  *         @arg @ref LL_GTZC2_GRP4_TZIC2
  *         @arg @ref LL_GTZC2_GRP4_SRAM4
  *         @arg @ref LL_GTZC2_GRP4_MPCBB4_REG
  */
__STATIC_INLINE void LL_GTZC_TZIC_EnableGrp2IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->IER2, periph);
}

