STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/**
  * @brief  Disable IER2 illegal access interrupt.
  * @rmtoll
  *  IER2           xxxIE         LL_GTZC_TZIC_DisableGrp2IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP4_SYSCFG
  *         @arg @ref LL_GTZC2_GRP4_RTC
  *         @arg @ref LL_GTZC2_GRP4_TAMP
  *         @arg @ref LL_GTZC2_GRP4_PWR
  *         @arg @ref LL_GTZC2_GRP4_RCC
  *         @arg @ref LL_GTZC2_GRP4_LPDMA1
  *         @arg @ref LL_GTZC2_GRP4_EXTI
  *         @arg @ref LL_GTZC2_GRP4_TZSC2
  *         @arg @ref LL_GTZC2_GRP4_TZIC2
  *         @arg @ref LL_GTZC2_GRP4_SRAM4
  *         @arg @ref LL_GTZC2_GRP4_MPCBB4_REG
  */
__STATIC_INLINE void LL_GTZC_TZIC_DisableGrp2IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_CLEAR_BIT(p_tzic->IER2, periph);
}

/**
  * @brief  Check if IER2 illegal access interrupt is enabled.
  * @rmtoll
  *  IER2           xxxIE         LL_GTZC_TZIC_IsEnabledGrp2IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  *
  *         @arg @ref LL_GTZC2_GRP2_SYSCFG
  *         @arg @ref LL_GTZC2_GRP2_RTC
  *         @arg @ref LL_GTZC2_GRP2_TAMP
  *         @arg @ref LL_GTZC2_GRP2_PWR
  *         @arg @ref LL_GTZC2_GRP2_RCC
  *         @arg @ref LL_GTZC2_GRP2_LPDMA1
  *         @arg @ref LL_GTZC2_GRP2_EXTI
  *         @arg @ref LL_GTZC2_GRP2_TZSC2
  *         @arg @ref LL_GTZC2_GRP2_TZIC2
  *         @arg @ref LL_GTZC2_GRP2_SRAM4
  *         @arg @ref LL_GTZC2_GRP2_MPCBB4_REG
  * @retval state of interrupt (0 Disabled / 1 Enabled).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsEnabledGrp2IT(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->IER2, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Enable IER3 illegal access interrupt.
  * @rmtoll
  *  IER3           xxxIE         LL_GTZC_TZIC_EnableGrp3IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  */
__STATIC_INLINE void LL_GTZC_TZIC_EnableGrp3IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->IER3, periph);
}

/**
  * @brief  Disable IER3 illegal access interrupt.
  * @rmtoll
  *  IER3           xxxIE         LL_GTZC_TZIC_DisableGrp3IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  */
__STATIC_INLINE void LL_GTZC_TZIC_DisableGrp3IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_CLEAR_BIT(p_tzic->IER3, periph);
}

/**
  * @brief  Check if IER3 illegal access interrupt is enabled.
  * @rmtoll
  *  IER3           xxxIE         LL_GTZC_TZIC_IsEnabledGrp3IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  * @retval State of interrupt (0 Disabled / 1 Enabled).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsEnabledGrp3IT(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->IER3, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Enable IER4 illegal access interrupt.
  * @rmtoll
  *  IER4           xxxIE         LL_GTZC_TZIC_EnableGrp4IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP4_GPDMA1
  *         @arg @ref LL_GTZC1_GRP4_FLASH_REG
  *         @arg @ref LL_GTZC1_GRP4_FLASH
  * @if OTFDEC1
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC1
  * @endif
  * @if OTFDEC2
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC2
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_TZSC1
  *         @arg @ref LL_GTZC1_GRP4_TZIC1
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI1_MEM
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP4_FSMC_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_BKPSRAM
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI2_MEM
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP4_HSPI1_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_SRAM1
  *         @arg @ref LL_GTZC1_GRP4_MPCBB1_REG
  *         @arg @ref LL_GTZC1_GRP4_SRAM2
  *         @arg @ref LL_GTZC1_GRP4_MPCBB2_REG
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM3
  *         @arg @ref LL_GTZC1_GRP4_MPCBB3_REG
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM5
  *         @arg @ref LL_GTZC1_GRP4_MPCBB5_REG
  *  @endif
  */
__STATIC_INLINE void LL_GTZC_TZIC_EnableGrp4IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->IER4, periph);
}

/**
  * @brief  Disable IER4 illegal access interrupt.
  * @rmtoll
  *  IER4           xxxIE         LL_GTZC_TZIC_DisableGrp4IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP4_GPDMA1
  *         @arg @ref LL_GTZC1_GRP4_FLASH_REG
  *         @arg @ref LL_GTZC1_GRP4_FLASH
  * @if OTFDEC1
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC1
  * @endif
  * @if OTFDEC2
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC2
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_TZSC1
  *         @arg @ref LL_GTZC1_GRP4_TZIC1
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI1_MEM
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP4_FSMC_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_BKPSRAM
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI2_MEM
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP4_HSPI1_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_SRAM1
  *         @arg @ref LL_GTZC1_GRP4_MPCBB1_REG
  *         @arg @ref LL_GTZC1_GRP4_SRAM2
  *         @arg @ref LL_GTZC1_GRP4_MPCBB2_REG
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM3
  *         @arg @ref LL_GTZC1_GRP4_MPCBB3_REG
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM5
  *         @arg @ref LL_GTZC1_GRP4_MPCBB5_REG
  *  @endif
  */
__STATIC_INLINE void LL_GTZC_TZIC_DisableGrp4IT(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_CLEAR_BIT(p_tzic->IER4, periph);
}

/**
  * @brief  Check if IER4 illegal access interrupt is enabled.
  * @rmtoll
  *  IER4           xxxIE         LL_GTZC_TZIC_IsEnabledGrp4IT
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP4_GPDMA1
  *         @arg @ref LL_GTZC1_GRP4_FLASH_REG
  *         @arg @ref LL_GTZC1_GRP4_FLASH
  * @if OTFDEC1
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC1
  * @endif
  * @if OTFDEC2
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC2
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_TZSC1
  *         @arg @ref LL_GTZC1_GRP4_TZIC1
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI1_MEM
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP4_FSMC_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_BKPSRAM
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI2_MEM
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP4_HSPI1_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_SRAM1
  *         @arg @ref LL_GTZC1_GRP4_MPCBB1_REG
  *         @arg @ref LL_GTZC1_GRP4_SRAM2
  *         @arg @ref LL_GTZC1_GRP4_MPCBB2_REG
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM3
  *         @arg @ref LL_GTZC1_GRP4_MPCBB3_REG
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM5
  *         @arg @ref LL_GTZC1_GRP4_MPCBB5_REG
  *  @endif
  * @retval State of interrupt (0 Disabled / 1 Enabled)
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsEnabledGrp4IT(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->IER4, periph) == periph) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup GTZC_LL_EF_TZIC_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Get SR1 illegal access flag.
  * @rmtoll
  *  SR1           xxxF         LL_GTZC_TZIC_IsActiveGrp1Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  * @retval State of flag (0 No-interrupt / 1 interrupt).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsActiveGrp1Flag(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->SR1, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Get SR2 illegal access flag.
  * @rmtoll
  *  SR2           xxxF         LL_GTZC_TZIC_IsActiveGrp2Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  *         @arg @ref LL_GTZC2_GRP2_SYSCFG
  *         @arg @ref LL_GTZC2_GRP2_RTC
  *         @arg @ref LL_GTZC2_GRP2_TAMP
  *         @arg @ref LL_GTZC2_GRP2_PWR
  *         @arg @ref LL_GTZC2_GRP2_RCC
  *         @arg @ref LL_GTZC2_GRP2_LPDMA1
  *         @arg @ref LL_GTZC2_GRP2_EXTI
  *         @arg @ref LL_GTZC2_GRP2_TZSC2
  *         @arg @ref LL_GTZC2_GRP2_TZIC2
  *         @arg @ref LL_GTZC2_GRP2_SRAM4
  *         @arg @ref LL_GTZC2_GRP2_MPCBB4_REG
  * @retval State of flag (0 No-interrupt / 1 interrupt).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsActiveGrp2Flag(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->SR2, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Get SR3 illegal access flag.
  * @rmtoll
  *  SR3           xxxF         LL_GTZC_TZIC_IsActiveGrp3Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  * @retval State of flag (0 No-interrupt / 1 interrupt).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsActiveGrp3Flag(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->SR3, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Get SR4 illegal access flag.
  * @rmtoll
  *  SR4           xxxF         LL_GTZC_TZIC_IsActiveGrp4Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP4_GPDMA1
  *         @arg @ref LL_GTZC1_GRP4_FLASH_REG
  *         @arg @ref LL_GTZC1_GRP4_FLASH
  * @if OTFDEC1
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC1
  * @endif
  * @if OTFDEC2
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC2
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_TZSC1
  *         @arg @ref LL_GTZC1_GRP4_TZIC1
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI1_MEM
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP4_FSMC_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_BKPSRAM
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI2_MEM
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP4_HSPI1_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_SRAM1
  *         @arg @ref LL_GTZC1_GRP4_MPCBB1_REG
  *         @arg @ref LL_GTZC1_GRP4_SRAM2
  *         @arg @ref LL_GTZC1_GRP4_MPCBB2_REG
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM3
  *         @arg @ref LL_GTZC1_GRP4_MPCBB3_REG
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM5
  *         @arg @ref LL_GTZC1_GRP4_MPCBB5_REG
  *  @endif
  * @retval State of flag (0 No-interrupt / 1 interrupt).
  */
__STATIC_INLINE uint32_t LL_GTZC_TZIC_IsActiveGrp4Flag(const GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  return ((READ_BIT(p_tzic->SR4, periph) == periph) ? 1UL : 0UL);
}

/**
  * @brief  Clear FCR1 illegal access flag.
  * @rmtoll
  *  FCR1           xxxF         LL_GTZC_TZIC_ClearGrp1Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP1_TIM2
  *         @arg @ref LL_GTZC1_GRP1_TIM3
  *         @arg @ref LL_GTZC1_GRP1_TIM4
  *         @arg @ref LL_GTZC1_GRP1_TIM5
  *         @arg @ref LL_GTZC1_GRP1_TIM6
  *         @arg @ref LL_GTZC1_GRP1_TIM7
  *         @arg @ref LL_GTZC1_GRP1_WWDG
  *         @arg @ref LL_GTZC1_GRP1_IWDG
  *         @arg @ref LL_GTZC1_GRP1_SPI2
  * @if USART2
  *         @arg @ref LL_GTZC1_GRP1_USART2
  * @endif
  *         @arg @ref LL_GTZC1_GRP1_USART3
  *         @arg @ref LL_GTZC1_GRP1_UART4
  *         @arg @ref LL_GTZC1_GRP1_UART5
  *         @arg @ref LL_GTZC1_GRP1_I2C1
  *         @arg @ref LL_GTZC1_GRP1_I2C2
  *         @arg @ref LL_GTZC1_GRP1_CRS
  *         @arg @ref LL_GTZC1_GRP1_I2C4
  *         @arg @ref LL_GTZC1_GRP1_LPTIM2
  *         @arg @ref LL_GTZC1_GRP1_FDCAN1
  * @if UCPD1
  *         @arg @ref LL_GTZC1_GRP1_UCPD1
  * @endif
  * @if USART6
  *         @arg @ref LL_GTZC1_GRP1_USART6
  * @endif
  * @if I2C5
  *         @arg @ref LL_GTZC1_GRP1_I2C5
  * @endif
  * @if I2C6
  *         @arg @ref LL_GTZC1_GRP1_I2C6
  * @endif
  *         @arg @ref LL_GTZC2_GRP1_SPI3
  *         @arg @ref LL_GTZC2_GRP1_LPUART1
  *         @arg @ref LL_GTZC2_GRP1_I2C3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM1
  *         @arg @ref LL_GTZC2_GRP1_LPTIM3
  *         @arg @ref LL_GTZC2_GRP1_LPTIM4
  *         @arg @ref LL_GTZC2_GRP1_OPAMP
  *         @arg @ref LL_GTZC2_GRP1_COMP
  *         @arg @ref LL_GTZC2_GRP1_ADC4
  *         @arg @ref LL_GTZC2_GRP1_VREFBUF
  *         @arg @ref LL_GTZC2_GRP1_DAC1
  *         @arg @ref LL_GTZC2_GRP1_ADF1
  */
__STATIC_INLINE void LL_GTZC_TZIC_ClearGrp1Flag(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->FCR1, periph);
}

/**
  * @brief Clear FCR2 illegal access flag.
  * @rmtoll
  *  FCR2           xxxF         LL_GTZC_TZIC_ClearGrp2Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP2_TIM1
  *         @arg @ref LL_GTZC1_GRP2_SPI1
  *         @arg @ref LL_GTZC1_GRP2_TIM8
  *         @arg @ref LL_GTZC1_GRP2_USART1
  *         @arg @ref LL_GTZC1_GRP2_TIM15
  *         @arg @ref LL_GTZC1_GRP2_TIM16
  *         @arg @ref LL_GTZC1_GRP2_TIM17
  *         @arg @ref LL_GTZC1_GRP2_SAI1
  * @if SAI2
  *         @arg @ref LL_GTZC1_GRP2_SAI2
  * @endif
  * @if GTZC_CFGR2_LTDCUSB_Msk
  *         @arg @ref LL_GTZC1_GRP2_LTDC_USB
  * @endif
  * @if DSI
  *         @arg @ref LL_GTZC1_GRP2_DSI
  * @endif
  *         @arg @ref LL_GTZC2_GRP2_SYSCFG
  *         @arg @ref LL_GTZC2_GRP2_RTC
  *         @arg @ref LL_GTZC2_GRP2_TAMP
  *         @arg @ref LL_GTZC2_GRP2_PWR
  *         @arg @ref LL_GTZC2_GRP2_RCC
  *         @arg @ref LL_GTZC2_GRP2_LPDMA1
  *         @arg @ref LL_GTZC2_GRP2_EXTI
  *         @arg @ref LL_GTZC2_GRP2_TZSC2
  *         @arg @ref LL_GTZC2_GRP2_TZIC2
  *         @arg @ref LL_GTZC2_GRP2_SRAM4
  *         @arg @ref LL_GTZC2_GRP2_MPCBB4_REG
  */
__STATIC_INLINE void LL_GTZC_TZIC_ClearGrp2Flag(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->FCR2, periph);
}

