STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gtzc.h
/**
  * @brief  Clear FCR3 illegal access flag.
  * @rmtoll
  *  FCR3           xxxF         LL_GTZC_TZIC_ClearGrp3Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP3_MDF1
  *         @arg @ref LL_GTZC1_GRP3_CORDIC
  *         @arg @ref LL_GTZC1_GRP3_FMAC
  *         @arg @ref LL_GTZC1_GRP3_CRC
  *         @arg @ref LL_GTZC1_GRP3_TSC
  * @if DMA2D
  *         @arg @ref LL_GTZC1_GRP3_DMA2D
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_ICACHE_REG
  *         @arg @ref LL_GTZC1_GRP3_DCACHE1_REG
  *         @arg @ref LL_GTZC1_GRP3_ADC12
  *         @arg @ref LL_GTZC1_GRP3_DCMI
  * @if USB_OTG_GLOBAL_BASE
  *         @arg @ref LL_GTZC1_GRP3_OTG
  * @endif
  * @if AES
  *         @arg @ref LL_GTZC1_GRP3_AES
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_HASH
  *         @arg @ref LL_GTZC1_GRP3_RNG
  * @if PKA
  *         @arg @ref LL_GTZC1_GRP3_PKA
  * @endif
  * @if SAES
  *         @arg @ref LL_GTZC1_GRP3_SAES
  * @endif
  * @if OCTOSPIM
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPIM
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_SDMMC1
  * @if SDMMC2
  *         @arg @ref LL_GTZC1_GRP3_SDMMC2
  * @endif
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP3_FSMC_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI1_REG
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP3_OCTOSPI2_REG
  * @endif
  *         @arg @ref LL_GTZC1_GRP3_RAMCFG
  * @if GPU2D
  *         @arg @ref LL_GTZC1_GRP3_GPU2D
  * @endif
  * @if GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU
  *         @arg @ref LL_GTZC1_GRP3_GFXMMU_REG
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP3_HSPI1_REG
  * @endif
  * @if DCACHE2
  *         @arg @ref LL_GTZC1_GRP3_DCACHE2_REG
  * @endif
  */
__STATIC_INLINE void LL_GTZC_TZIC_ClearGrp3Flag(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->FCR3, periph);
}

/**
  * @brief  Clear FCR4 illegal access flag.
  * @rmtoll
  *  FCR4           xxxF         LL_GTZC_TZIC_ClearGrp4Flag
  * @param  p_tzic TZIC Instance
  * @param  periph This parameter can be one of the following values:
  *         @arg @ref LL_GTZC1_GRP4_GPDMA1
  *         @arg @ref LL_GTZC1_GRP4_FLASH_REG
  *         @arg @ref LL_GTZC1_GRP4_FLASH
  * @if OTFDEC1
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC1
  * @endif
  * @if OTFDEC2
  *         @arg @ref LL_GTZC1_GRP4_OTFDEC2
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_TZSC1
  *         @arg @ref LL_GTZC1_GRP4_TZIC1
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI1_MEM
  * @if FMC_BASE
  *         @arg @ref LL_GTZC1_GRP4_FSMC_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_BKPSRAM
  * @if OCTOSPI2
  *         @arg @ref LL_GTZC1_GRP4_OCTOSPI2_MEM
  * @endif
  * @if HSPI1
  *         @arg @ref LL_GTZC1_GRP4_HSPI1_MEM
  * @endif
  *         @arg @ref LL_GTZC1_GRP4_SRAM1
  *         @arg @ref LL_GTZC1_GRP4_MPCBB1_REG
  *         @arg @ref LL_GTZC1_GRP4_SRAM2
  *         @arg @ref LL_GTZC1_GRP4_MPCBB2_REG
  * @if SRAM3_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM3
  *         @arg @ref LL_GTZC1_GRP4_MPCBB3_REG
  * @endif
  * @if SRAM5_BASE
  *         @arg @ref LL_GTZC1_GRP4_SRAM5
  *         @arg @ref LL_GTZC1_GRP4_MPCBB5_REG
  *  @endif
  */
__STATIC_INLINE void LL_GTZC_TZIC_ClearGrp4Flag(GTZC_TZIC_TypeDef *p_tzic, uint32_t periph)
{
  ATOMIC_SET_BIT(p_tzic->FCR4, periph);
}

/**
  * @}
  */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5xx_LL_GTZC_H */
